In [1]:
import pandas as pd

df = pd.read_csv('cafe4.csv')  # https://kdh9797-devwiki.tistory.com/85
df.head()

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20  코스타리카     NaN

len()

In [4]:
# 데이터프레임의 행의 수 구하기

print(len(df))
print(df.shape[0])

8
8

sum()

In [ ]:
df['가격'] > 5000

0    False
1    False
2     True
3    False
4    False
5     True
6     True
7    False
Name: 가격, dtype: bool

In [11]:
print(sum(df['가격'] > 5000))
print(len(df[df['가격'] > 5000]))

3
3

In [12]:
df.sum(numeric_only=True)

가격      37200.0
칼로리       730.0
이벤트가     2000.0
dtype: float64

In [ ]:
# 행별 합계

df.sum(axis=1, numeric_only=True)

0    4510.0
1    6110.0
2    6750.0
3    5110.0
4    4020.0
5    6110.0
6    5300.0
7    2020.0
dtype: float64

통계 함수

In [18]:
print('최댓값: ', df['가격'].max())
print('최솟값: ', df['가격'].min())
print('평균값: ', df['가격'].mean())
print('중앙값: ', df['가격'].median())
print('합계: ', df['가격'].sum())
print('표준편차: ', df['가격'].std())
print('분산: ', df['가격'].var())

최댓값:  5900
최솟값:  2000
평균값:  4650.0
중앙값:  5000.0
합계:  37200
표준편차:  1220.070255588353
분산:  1488571.4285714286

quantile()

In [21]:
print('분위수 25% 값: ', df['가격'].quantile(.25))
print('분위수 75% 값: ', df['가격'].quantile(.75))

분위수 25% 값:  4375.0
분위수 75% 값:  5350.0

In [22]:
# 가격이 하위 25% 보다 작은 가격을 출력

df[df['가격'].quantile(.25) > df['가격']]

      메뉴    가격  칼로리    원산지  이벤트가
4  에스프레소  4000   20  코스타리카   NaN
7   달콤커피  2000   20  코스타리카   NaN

In [23]:
# 가격이 상위 25% 보다 큰 가격을 출력

df[df['가격'].quantile(.75) < df['가격']]

     메뉴    가격  칼로리    원산지    이벤트가
2  카페모카  5500  250   과테말라  1000.0
5   밀크티  5900  210  코스타리카     NaN

mode()

In [25]:
df['원산지'].mode()

0    코스타리카
Name: 원산지, dtype: object

In [26]:
df['원산지'].mode()[0]

'코스타리카'

idxmax(), idxmin()

In [27]:
# 가격이 최댓값인 인덱스

df['가격'].idxmax()

5

In [31]:
# 가격이 최댓값인 데이터 정보

df.loc[df['가격'].idxmax()]

메뉴        밀크티
가격       5900
칼로리       210
원산지     코스타리카
이벤트가      NaN
Name: 5, dtype: object

In [34]:
# 가격이 최댓값인 메뉴는?

df.loc[df['가격'].idxmax(), '메뉴']

'밀크티'

nlargest(), nsmallest()

In [ ]:
# 가격 중 큰 값 3개를 출력

df.nlargest(3, '가격')

     메뉴    가격  칼로리    원산지    이벤트가
5   밀크티  5900  210  코스타리카     NaN
2  카페모카  5500  250   과테말라  1000.0
6    녹차  5300    0   대한민국     NaN

In [36]:
df.nsmallest(4, '가격')

      메뉴    가격  칼로리    원산지    이벤트가
7   달콤커피  2000   20  코스타리카     NaN
4  에스프레소  4000   20  코스타리카     NaN
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0

apply

In [38]:
def cal(x):
  if x >= 100:
    return "NO"
  else:
    return "YES"

df['먹어도 되나요'] = df['칼로리'].apply(cal)
df.head()

      메뉴    가격  칼로리    원산지    이벤트가 먹어도 되나요
0  아메리카노  4500   10   콜롬비아     NaN     YES
1   카페라떼  5000  110  코스타리카  1000.0      NO
2   카페모카  5500  250   과테말라  1000.0      NO
3   카푸치노  5000  110   과테말라     NaN      NO
4  에스프레소  4000   20  코스타리카     NaN     YES

melt()

In [39]:
import pandas as pd

df = pd.DataFrame({'Name': ['쿼카', '알파카', '시바견'],
                   '수학': [90, 93, 85],
                   '영어': [92, 84, 86],
                   '국어': [91, 94, 83]})
df

  Name  수학  영어  국어
0   쿼카  90  92  91
1  알파카  93  84  94
2  시바견  85  86  83

In [43]:
pd.melt(df, id_vars=['Name'])

  Name variable  value
0   쿼카       수학     90
1  알파카       수학     93
2  시바견       수학     85
3   쿼카       영어     92
4  알파카       영어     84
5  시바견       영어     86
6   쿼카       국어     91
7  알파카       국어     94
8  시바견       국어     83

In [44]:
pd.melt(df, id_vars=['Name'], value_vars=['수학', '영어'])

  Name variable  value
0   쿼카       수학     90
1  알파카       수학     93
2  시바견       수학     85
3   쿼카       영어     92
4  알파카       영어     84
5  시바견       영어     86